Case/Unprotection/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(

    (-2.747 -6.614 -4.717  )
    (2.747 -6.614  -4.717  )
    (2.747  6.614  -4.717  )
    (-2.747 6.614  -4.717  )


    (-2.747 -6.614 4.717  )
    (2.747 -6.614  4.717  )
    (2.747  6.614  4.717  )
    (-2.747 6.614  4.717  )

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (110 264 188) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
