Case/Unprotection/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    gongzuomian;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name walls;
        }
    }

    {
        name    inletone;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.027 -0.065 -0.0465)(-0.01 -0.045 -0.0457);
        }
    }
    
    


//inlettwo
   
    {
        name    inlettwo;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {
            set  gongzuomian;
        }
    }

     {
        name    inlettwo;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.005 -0.075 -0.0465)(0.015 -0.045 -0.0457);
        }
    }

//outlet

    {
        name    outlet;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {
            set  gongzuomian;
        }
    }


    {
        name    outlet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.005 0.05 -0.0465)(0.012 0.066 -0.0457);
        }
    }

//wall patch
    {
        name    rock;
        type    faceSet;
        action  new;
        source  faceToFace;
        sourceInfo
        {
            set  gongzuomian;
        }
    }

    {
        name    rock;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
            set  inletone;
        }
    }
    
    {
        name    rock;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
            set  inlettwo;
        }
    }

    {
        name    rock;
        type    faceSet;
        action  delete;
        source  faceToFace;
        sourceInfo
        {
            set  outlet;
        }
    }

    

);
// ************************************************************************* //
